<?php

return array(
    'name' => 'Тип',
    
    'header.title' => 'Тип объекта',
    'header.description' => 'создание и редактирование',

    'list.name' => 'Типы объектов',
    'list.names' => 'Типы объектов',
    'list.create' => 'Создание типа',
    'list.edit' => 'Редактирование типа',
    'list.btn.edit' => 'Редактирование типа',
    'list.btn.delete' => 'Удаление типа',
	
    'error.class_model.name' => 'Неправильное имя класса объекта. Имя класса должно начинаться с A-Z и содержать только [a-z1-9_\]',
    'error.class_controller.name' => 'Неправильное имя класса формы объекта. Имя класса должно начинаться с A-Z и содержать только [a-z1-9_\]',

    'error.namespace.search' => 'Не существует namespace, который содержит часть ":path"',
    'error.table.create' => 'Невозможно создать таблицу ":table"',
    'error.file.create' => 'Невозможно создать файл по пути ":path"',
    'error.class_controller.define' => 'Класс не определен или не выбрана папка размещения файла класса формы',
    'error.code_empty' => 'Пожалуйста, прежде укажите значение в поле "Код типа"',
    'error.class_controller_exists' => 'Класс формы уже существует. Укажите другое имя класса',
    'error.class_model_exists' => 'Класс модели объекта уже существует. Укажите другое имя класса',

    'error' => array(
        'code.regex' => 'Поле "Код типа" должно начинаться с латинской буквы и содержать латинские символы, цифры или символ подчеркивания'
    ),
);
