<?php

return array(
    'header' => 'Установка приложения Telenok CMS',
    'btn.prev' => 'Назад',
    'btn.next' => 'Далее',
    'btn.finish' => 'Перейди в Панель управления',

    'step.1.title' => 'Первый шаг',
    'step.1.description.title' => 'Общая информация',
    'step.1.description' => '<h4><i class="fa fa-bell-o green"></i> Уважаемый пользователь!</h4><br/>Вы устанавливаете лицензионный продукт Telenok CMS.<br/>
        Широкие возможности продукта и большое сообщество владельцев и разработчиков сайтов помогут Вам реализовать задумки и воплотить мечты.<br/>
        Благодарим Вас за использование продукта и желаем успехов в работе!',
    
    'step.2.title' => 'Второй шаг',
    'step.2.description.title' => 'Проверка системы',
    'step.2.description' => '<h4><i class="fa fa-bell-o green"></i> Уважаемый пользователь!</h4><br/>Вы устанавливаете лицензионный продукт Telenok CMS.<br/>
        Широкие возможности продукта и большое сообщество владельцев и разработчиков помогут Вам реализовать задумки и воплотить мечты.<br/>
        Благодарим Вас за использование продукта и желаем успехов в работе!',
    
    'step.3.title' => 'Третий шаг',
    'step.3.description.title' => 'Введение параметров',
    'step.3.description' => 'Для правильной работы приложения необходимо определить несколько параметров. Пожалуйста, аккуратно заполните поля, проверяя корректность ввода.',
    
    'step.4.title' => 'Установка завершена',
    'step.4.description.title' => 'Данные доступа',
    'step.4.description' => '<h4><i class="fa fa-bell-o green"></i> Уважаемый пользователь!</h4><br/>Вы установили лицензионный продукт Telenok CMS.<br/>
        После нажатия на кнопку "Перейди в Панель управления" вы будете переадресованы на страницу авторизации.<br/>
        В Панели управления Вы будете обладать правами супер-администратора.<br/>Желаем успехов в работе!',
    
    'os' => 'Операционная система',
    'php.version' => 'Версия PHP',
    'php.version.error' => 'Ошибка! Версия PHP должна быть не ниже 5.4.0', 
    'directory.install' => 'Директория установки', 
    'directory.writeable' => 'Права на запись', 
    'directory.writeable.error' => 'Директория ":dir" и все её поддиректории должны иметь разрешение для PHP на запись',
    'param.domain' => 'Главный домен сайта', 
    'param.domain.example' => 'Например: telenok.com', 
    'param.domain.error' => 'Пожалуйста, проверьте правильность домена', 
    'param.licence.key' => 'Ключ лицензии', 
    'param.licence.key.example' => 'Получить ключ', 
    'param.db_type' => 'Тип базы данных', 
    'param.db_host' => 'Адрес сервера базы данных', 
    'param.db_host.example' => 'Например: 192.168.0.100', 
    'param.db_host.error' => 'Пожалуйста, проверьте правильность адреса', 
    'param.db_username' => 'Пользователь базы данных', 
    'param.db_username.example' => 'Например: root', 
    'param.db_username.error' => 'Невозможно подключиться к базе данных. Проверьте адрес сервера БД, имя БД, имя и пароль пользователя БД.', 
    'param.db_password' => 'Пароль пользователя базы данных', 
    'param.db_prefix' => 'Префикс таблиц базы данных', 
    'param.db_prefix.example' => 'Необязательный параметр', 
    'param.db_prefix.error' => 'Некорректный префикс. Префикс должен содержать латинские символы или цифры и начинаться с латинской буквы.', 
    
    'param.db_database' => 'Имя базы данных', 
    'param.db_database.example' => 'Например, laravel', 
    'param.db_database.error' => 'Некорректное имя базы данных. Имя БД должно содержать латинские символы или цифры и начинаться с латинской буквы.', 
    
    'param.locale' => 'Язык по умолчанию', 

    'param.superuser_login' => 'Логин суперпользователя', 
    'param.superuser_login.example' => 'Например, admin', 
    'param.superuser_login.error' => 'Некорректный логин суперпользователя. Логин должен содержать латинские символы или цифры и начинаться с латинской буквы.', 
    
    'param.superuser_password' => 'Пароль суперпользователя', 
    'param.superuser_password.example' => 'Не менее восьми символов', 
    'param.superuser_password.error' => 'Некорректный пароль суперпользователя. Пароль суперпользователя должен содержать восемь и более символов.', 

    
    'error.common' => 'Пожалуйста, проверьте правильность ввода данных.'
);
